In [7]:
!pip3 install sqlalchemy # ORM for databases
!pip3 install ipython-sql # SQL magic function

Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.7/dist-packages (1.4.35)
Requirement already satisfied: importlib-metadata in /usr/local/lib/python3.7/dist-packages (from sqlalchemy) (4.11.3)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.7/dist-packages (from sqlalchemy) (1.1.2)
Requirement already satisfied: typing-extensions>=3.6.4 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy) (4.1.1)
Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy) (3.8.0)
Requirement already satisfied: ipython-sql in /usr/local/lib/python3.7/dist-packages (0.3.9)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (0.4.2)
Requirement already satisfied: sqlalchemy>=0.6.7 in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (1.4.35)
Requirement already satisfied: six in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: ipython>=1.0 in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (5.5.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (3.2.0)
Requirement already satisfied: prompt-toolkit<2.0.0,>=1.0.4 in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (1.0.18)
Requirement already satisfied: decorator in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: simplegeneric>0.8 in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (0.8.1)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (57.4.0)
Requirement already satisfied: pexpect in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (4.8.0)
Requirement already satisfied: pygments in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (2.6.1)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.7/dist-packages (from prompt-toolkit<2.0.0,>=1.0.4->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: importlib-metadata in /usr/local/lib/python3.7/dist-packages (from sqlalchemy>=0.6.7->ipython-sql) (4.11.3)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.7/dist-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.2)
Requirement already satisfied: typing-extensions>=3.6.4 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy>=0.6.7->ipython-sql) (4.1.1)
Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy>=0.6.7->ipython-sql) (3.8.0)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.7/dist-packages (from pexpect->ipython>=1.0->ipython-sql) (0.7.0)

In [8]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## Connect With Your Credentials

The current connection string DOES NOT WORK!   
Make sure to change the YOURUSER:YOURPASSWORD part of the connection string to your team's account information!

In [9]:
%sql postgresql://zs2489:7842@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2

'Connected: zs2489@proj1part2'

In [ ]:
# change your password
%%sql ALTER ROLE YOURUNI   
WITH PASSWORD 'YOURNEWPASSWORD';

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [ ]:
# create table
%%sql CREATE TABLE R (
    A int,
    B int
);
INSERT INTO R VALUES (1,2);
INSERT INTO R VALUES (3,4);

In [ ]:
# see table R
%sql SELECT * FROM R;

In [ ]:
# see all the tables you have
%%sql SELECT *
FROM pg_catalog.pg_tables
WHERE tableowner='zs2489'

 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
15 rows affected.

[('zs2489', 'languages', 'zs2489', None, True, False, True, False),
 ('zs2489', 'schools', 'zs2489', None, True, False, True, False),
 ('zs2489', 'majors', 'zs2489', None, True, False, True, False),
 ('zs2489', 'users', 'zs2489', None, True, False, True, False),
 ('zs2489', 'native_language', 'zs2489', None, True, False, True, False),
 ('zs2489', 'learn_language', 'zs2489', None, True, False, True, False),
 ('zs2489', 'follows', 'zs2489', None, True, False, True, False),
 ('zs2489', 'moments', 'zs2489', None, True, False, True, False),
 ('zs2489', 'comments', 'zs2489', None, True, False, True, False),
 ('zs2489', 'events', 'zs2489', None, True, False, True, False),
 ('zs2489', 'like_moment', 'zs2489', None, True, False, True, False),
 ('zs2489', 'join_event', 'zs2489', None, True, False, True, False),
 ('zs2489', 'resources', 'zs2489', None, True, False, True, False),
 ('zs2489', 'reviews', 'zs2489', None, True, False, True, False),
 ('zs2489', 'vote_review', 'zs2489', None, True, False, True, False)]

In [16]:
%%sql
DROP FUNCTION IF EXISTS f_update_like_count, f_delete_like_count, f_update_join_event CASCADE;

DROP TRIGGER IF EXISTS t_update_like_count ON like_comment CASCADE;
DROP TRIGGER IF EXISTS t_delete_like_count ON like_comment CASCADE;
DROP TRIGGER IF EXISTS t_update_join_event ON join_event CASCADE;

DROP TABLE IF EXISTS schools, majors, languages, users, native_language, learn_language, follows, moments, comments, like_moment, events, join_event, resources, reviews, vote_review CASCADE;


CREATE TABLE schools (
  school_id int,
  school_name char(100),
  PRIMARY KEY(school_id)
);

CREATE TABLE majors (
  major_id int,
  major_name char(25),
  PRIMARY KEY(major_id)
);

CREATE TABLE languages (
  language_id int,
  language_name char(25),
  PRIMARY KEY(language_id)
);

CREATE TABLE users (
  user_id serial,
  user_name char(15) NOT NULL, --standard username length 1 to 15
  user_password varchar(255) NOT NULL, --hashed password
  self_introduction varchar(255) NOT NULL, --User can input interests, hobbies, places want to go
  school_name_id smallint,
  major_name_id smallint,
  email varchar(255),
  age smallint,
  sex smallint,
  user_deleted bool DEFAULT FALSE,  --fake delete from user end
  PRIMARY KEY(user_id),
  FOREIGN KEY(school_name_id) REFERENCES schools(school_id),  --can be null
  FOREIGN KEY(major_name_id) REFERENCES majors(major_id),   --can be null
  CONSTRAINT email_valid_cheak CHECK (email LIKE '%@%' OR email = NULL)
  --CONSTRAINT age_range_check CHECK ((age >= 13 AND age <= 120) OR age = NULL),  --reference: hellotalk rating stardard in north&south america
  --CONSTRAINT gender_selection_check CHECK (sex IN (0, 1, 2, 9) OR sex = NULL)  --ISO/IEC 5218 standard sex 0:Not known 1:Male 2:Female 9:Not applicable
);

CREATE TABLE native_language (
  uid int,
  lid int,
  PRIMARY KEY(uid, lid),
  FOREIGN KEY(uid) REFERENCES users(user_id) ON DELETE CASCADE,
  FOREIGN KEY(lid) REFERENCES languages(language_id) ON DELETE CASCADE
);

CREATE TABLE learn_language (
  uid int,
  lid int, 
  level smallint DEFAULT 1,
  PRIMARY KEY(uid, lid),
  FOREIGN KEY(uid) REFERENCES users(user_id) ON DELETE CASCADE,
  FOREIGN KEY(lid) REFERENCES languages(language_id) ON DELETE CASCADE,
  CONSTRAINT level_valid_check CHECK (level IN (1,2,3,4,5))  --1:Begineer, 2:Elementary, 3:Intermediate, 4:Advanced, 5:Proficient
);

CREATE TABLE follows (
  follower_id int,
  followed_id int,
  PRIMARY KEY(follower_id, followed_id),
  FOREIGN KEY(follower_id) REFERENCES users(user_id) ON DELETE CASCADE,
  FOREIGN KEY(followed_id) REFERENCES users(user_id) ON DELETE CASCADE
);

CREATE TABLE moments (
  moment_id serial,
  uid int NOT NULL,
  moment_content text NOT NULL,
  moment_post_time timestamp NOT NULL,
  like_count int DEFAULT 0,
  user_deleted bool DEFAULT FALSE,  --fake delete from user end
  PRIMARY KEY(moment_id),
  FOREIGN KEY(uid) REFERENCES users(user_id) ON DELETE CASCADE
);

CREATE TABLE comments (
  comment_id serial,
  mid int NOT NULL,
  uid int NOT NULL,
  comment_content varchar(255) NOT NULL, --building like comments, using @ to point to the parent_id 
  comment_post_time timestamp NOT NULL,
  parent_comment_id int,  -- if null, it is a direct comment. if not null, user use @ to @ someone.
  user_deleted bool DEFAULT FALSE,  --fake delete from user end
  PRIMARY KEY(comment_id),
  FOREIGN KEY(uid) REFERENCES users(user_id) ON DELETE CASCADE,   --What if the delete of user is be @ by other user. If delete, should it be ON DELTE CASCADE.
  FOREIGN KEY(mid) REFERENCES moments(moment_id) ON DELETE CASCADE
);

CREATE TABLE like_moment (
  uid int NOT NULL,
  mid int NOT NULL,
  PRIMARY KEY(uid, mid),
  FOREIGN KEY(uid) REFERENCES users(user_id) ON DELETE CASCADE,
  FOREIGN KEY(mid) REFERENCES moments(moment_id) ON DELETE CASCADE
);

CREATE FUNCTION f_update_like_count() RETURNS trigger
AS $$
BEGIN
  UPDATE moments
  SET like_count = like_count + 1
  WHERE moment_id = NEW.mid;
  RETURN NULL;
END;
$$ LANGUAGE plpgsql;

CREATE TRIGGER t_update_like_count 
  AFTER INSERT ON like_moment
  FOR EACH ROW
    EXECUTE PROCEDURE f_update_like_count();

CREATE TABLE events (
  event_id serial,
  uid int NOT NULL,
  event_title char(50) NOT NULL,
  event_content text NOT NULL,
  event_post_time timestamp NOT NULL,
  is_allday bool DEFAULT TRUE,
  join_limit int DEFAULT 1000,
  join_count int DEFAULT 0,
  start_date date NOT NULL DEFAULT CURRENT_DATE,
  end_date date,
  start_time time,
  end_time time,
  user_deleted bool DEFAULT FALSE, --fake delete from user end
  PRIMARY KEY(event_id),
  FOREIGN KEY(uid) REFERENCES users(user_id) ON DELETE CASCADE,
  CONSTRAINT join_limit_check CHECK (join_limit >= join_count),
  CHECK (((start_time is NULL AND end_time is NULL) OR is_allday = FALSE) AND ((start_time is NOT NULL AND end_time is NOT NULL) OR is_allday = TRUE))
);

CREATE TABLE join_event (
  uid int NOT NULL,
  eid int NOT NULL,
  join_time timestamp NOT NULL,
  PRIMARY KEY(uid, eid),
  FOREIGN KEY(uid) REFERENCES users(user_id) ON DELETE CASCADE,
  FOREIGN KEY(eid) REFERENCES events(event_id) ON DELETE CASCADE
);

CREATE FUNCTION f_update_join_event() RETURNS trigger
AS $$
BEGIN
  UPDATE events
  SET join_count = join_count + 1
  WHERE event_id = NEW.eid;
  RETURN NULL;
END;
$$ LANGUAGE plpgsql;

CREATE TRIGGER t_update_join_event
  AFTER INSERT ON join_event
  FOR EACH ROW
    EXECUTE PROCEDURE f_update_join_event();

CREATE TABLE resources (
  resource_id serial,
  uid int NOT NULL,
  resource_title char(140) NOT NULL,
  resource_type varchar(255) NOT NULL,  --see check constraint.
  recource_content text NOT NULL,
  recource_linkage varchar(255),
  resource_post_time timestamp NOT NULL,
  avg_stars real DEFAULT NULL,  --the average score of the resource in the form of 5 stars
  user_deleted bool DEFAULT FALSE,
  PRIMARY KEY(resource_id),
  FOREIGN KEY(uid) REFERENCES users(user_id) ON DELETE CASCADE,
  CONSTRAINT select_resource_type CHECK (resource_type IN ('Book', 'Video', 'Online Tutorial', 'Learning Experience', 'Language Exam'))
);

CREATE TABLE reviews (
  review_id serial,
  rid int NOT NULL,
  uid int NOT NULL,
  review_content text NOT NULL,
  review_post_time timestamp NOT NULL,
  star_score smallint DEFAULT NULL, --the star score to the resource
  avg_vote_score smallint DEFAULT 0,  --the vote score of the review (whether the review is good or bad)
  PRIMARY KEY(review_id),
  FOREIGN KEY(rid) REFERENCES resources(resource_id) ON DELETE CASCADE,
  FOREIGN KEY(uid) REFERENCES users(user_id) ON DELETE CASCADE,
  CONSTRAINT star_valid_check CHECK (star_score IN (1,2,3,4,5))
);

CREATE TABLE vote_review (
  rid int NOT NULL,
  uid int NOT NULL,
  vote int NOT NULL,
  PRIMARY KEY(uid, rid),
  FOREIGN KEY(rid) REFERENCES reviews(review_id) ON DELETE CASCADE,
  FOREIGN KEY(uid) REFERENCES users(user_id) ON DELETE CASCADE,
  CONSTRAINT vote_valid_check CHECK (vote in (-1,1)) --If user think the review is good, vote score of the review will plus 1. Otherwise, vote score of the review will minus 1.
);

 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [17]:
import pandas as pd
import os
main_path = 'https://raw.githubusercontent.com/litony99/language_platform/main/external_data_files/csv_files'
file_names = ['schools.csv','majors.csv','languages.csv','users.csv','native_language.csv','learn_language.csv','follows.csv','moments.csv','comments.csv','like_moment.csv','events.csv','join_event.csv','resources.csv','reviews.csv','vote_review.csv']
file_columns_count = [2,2,2,9,2,2,3,6,7,2,13,3,9,7,3] #how many attributes are there for each table

path_lists = []
for i in range(len(file_names)):
  file_path = os.path.join(main_path, file_names[i])
  path_lists.append(file_path)
for j in range(len(path_lists)):
  df = pd.read_csv(path_lists[j])
  print(df.columns)
  if j == 0:
    for index, row in df.iterrows():
      a = row[0]
      b = row[1]
      %sql INSERT INTO schools VALUES (:a,:b);
    print(f"Loading {file_names[j]} success!\n\n")
  elif j == 1:
    for index, row in df.iterrows():
      a = row[0]
      b = row[1]
      %sql INSERT INTO majors VALUES (:a,:b);
    print(f"Loading {file_names[j]} success!\n\n")
  elif j == 2:
    for index, row in df.iterrows():
      a = row[0]
      b = row[1]
      %sql INSERT INTO languages VALUES (:a,:b);
    print(f"Loading {file_names[j]} success!\n\n")
  elif j == 3:
    for index, row in df.iterrows():
      a = row[0]
      b = row[1]
      c = row[2]
      d = row[3]
      e = row[4]
      f = row[5]
      g = row[6]
      h = row[7]
      i = row[8]
      %sql INSERT INTO users VALUES (:a,:b,:c,:d,:e,:f,:g,:h,:i);
    print(f"Loading {file_names[j]} success!\n\n")
  elif j == 4:
    for index, row in df.iterrows():
      a = row[0]
      b = row[1]
      %sql INSERT INTO native_language VALUES (:a,:b);
    print(f"Loading {file_names[j]} success!\n\n")
  elif j == 5:
    for index, row in df.iterrows():
      a = row[0]
      b = row[1]
      c = row[2]
      %sql INSERT INTO learn_language VALUES (:a,:b,:c);
    print(f"Loading {file_names[j]} success!\n\n")
  elif j == 6:
    for index, row in df.iterrows():
      a = row[0]
      b = row[1]
      %sql INSERT INTO follows VALUES (:a,:b);
    print(f"Loading {file_names[j]} success!\n\n")
  elif j == 7:
    for index, row in df.iterrows():
      a = row[0]
      b = row[1]
      c = row[2]
      d = row[3]
      e = row[4]
      f = row[5]
      %sql INSERT INTO moments VALUES (:a,:b,:c,:d,:e,:f);
    print(f"Loading {file_names[j]} success!\n\n")
  elif j == 8:
    for index, row in df.iterrows():
      a = row[0]
      b = row[1]
      c = row[2]
      d = row[3]
      e = row[4]
      f = row[5]
      g = row[6]
      %sql INSERT INTO comments VALUES (:a,:b,:c,:d,:e,:f,:g);
    print(f"Loading {file_names[j]} success!\n\n")
  elif j == 9:
    for index, row in df.iterrows():
      a = row[0]
      b = row[1]
      %sql INSERT INTO like_moment VALUES (:a,:b);
    print(f"Loading {file_names[j]} success!\n\n")
  elif j == 10:
    for index, row in df.iterrows():
      a = row[0]
      b = row[1]
      c = row[2]
      d = row[3]
      e = row[4]
      f = row[5]
      g = row[6]
      h = row[7]
      i = row[8]
      j = row[9]
      k = row[10]
      l = row[11]
      m = row[12]
      %sql INSERT INTO events VALUES (:a,:b,:c,:d,:e,:f,:g,:h,:i,:j,:k,:l,:m);
    
  elif j == 11:
    for index, row in df.iterrows():
      a = row[0]
      b = row[1]
      c = row[2]
      %sql INSERT INTO join_event VALUES (:a,:b,:c);
    print(f"Loading {file_names[j]} success!\n\n")
  elif j == 12:
    for index, row in df.iterrows():
      a = row[0]
      b = row[1]
      c = row[2]
      d = row[3]
      e = row[4]
      f = row[5]
      g = row[6]
      h = row[7]
      i = row[8]
      %sql INSERT INTO resources VALUES (:a,:b,:c,:d,:e,:f,:g,:h,:i);
    print(f"Loading {file_names[j]} success!\n\n")
  elif j == 13:
    for index, row in df.iterrows():
      a = row[0]
      b = row[1]
      c = row[2]
      d = row[3]
      e = row[4]
      f = row[5]
      g = row[6]
      %sql INSERT INTO reviews VALUES (:a,:b,:c,:d,:e,:f,:g);
    print(f"Loading {file_names[j]} success!\n\n")
  elif j == 14:
    for index, row in df.iterrows():
      a = row[0]
      b = row[1]
      c = row[2]
      %sql INSERT INTO vote_review VALUES (:a,:b,:c);
    print(f"Loading {file_names[j]} success!\n\n")

Index(['school_id', 'school_name'], dtype='object')
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
Loading schools.csv success!


Index(['major_id', 'major_name'], dtype='object')
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
Loading majors.csv success!


Index(['language_id', ' language_name'], dtype='object')
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
Loading languages.csv success!


Index(['user_id', 'user_name', 'user_password', 'self_introduction',
       'school_name_id', 'major_name_id', 'email', 'age', 'sex',
       'user_deleted'],
      dtype='object')
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
Loading users.csv success!


Index(['uid', 'lid', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4', 'Unnamed: 5',
       'Unnamed: 6'],
      dtype='object')
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
Loading native_language.csv success!


Index(['uid', 'lid', 'level', 'Unnamed: 3', 'Unnamed: 4', 'Unnamed: 5',
       'Unnamed: 6'],
      dtype='object')
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
Loading learn_language.csv success!


Index(['follower_id', 'followed_id', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5', 'Unnamed: 6'],
      dtype='object')
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
Loading follows.csv success!


Index(['moment_id', 'uid', 'moment_content', 'moment_post_time', 'like_count',
       'user_deleted', 'Unnamed: 6'],
      dtype='object')
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
Loading moments.csv success!


Index(['comment_id', 'mid', 'uid', 'comment_content', 'comment_post_time',
       'parent_comment_id', 'user_deleted'],
      dtype='object')
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
Loading comments.csv success!


Index(['uid', 'mid', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4', 'Unnamed: 5',
       'Unnamed: 6'],
      dtype='object')
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
Loading like_moment.csv success!


Index(['event_id', 'uid', 'event_title', 'event_content', 'event_post_time',
       'is_allday', 'join_limit', 'join_count', 'start_date', 'end_date',
       'start_time', 'end_time', 'user_deleted'],
      dtype='object')
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
Index(['uid', 'eid', 'join_time', 'Unnamed: 3', 'Unnamed: 4', 'Unnamed: 5',
       'Unnamed: 6'],
      dtype='object')
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
Loading join_event.csv success!


Index(['resource_id', 'uid', 'resource_title', 'resource_type',
       'resource_content', 'resource_linkage', 'resource_post_time',
       'avg_stars', 'user_deleted'],
      dtype='object')
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
Loading resources.csv success!


Index(['review_id', 'rid', 'uid', 'review_content', 'review_post_time',
       'star_score', 'avg_vote_score'],
      dtype='object')
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
Loading reviews.csv success!


Index(['rid', 'uid', 'Vote', 'Unnamed: 3', 'Unnamed: 4', 'Unnamed: 5',
       'Unnamed: 6'],
      dtype='object')
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
Loading vote_review.csv success!

In [ ]:
%%sql
INSERT INTO schools VALUES (1, '')
INSERT INTO majors VALUES (1, 'Business'), (2, 'Psychology'), (3, 'Biology'), (4, 'Engineering'), (5, 'Education'), (6, 'Computer Science');
INSERT INTO users VALUES (1 ,'Zhou Shen', 'XXX', 'Hi! I like cooking. I wanna to visit Japan.', 1, 4, 'zs2489@columbia.edu', 25, 1);
INSERT INTO users VALUES (2 ,'Tony Li', 'XXX', 'Hi! I am a programmer, I love traveling. I wanna to visit Spain', 1, 6, 'yl4832@columbia.edu', 24, 1);
INSERT INTO users VALUES (3 ,'Wu', 'XXX', 'Hi! I teach database. I love coding and working out. I wanna to visit Korea.', 1, 6, NULL, 30, 1);
INSERT INTO moments VALUES (1, 1, 'Just watched the Demon Slayer, yyds', '2022/4/13 13:30:00', 0 , DEFAULT);
INSERT INTO moments VALUES (2, 1, 'Today, I learned the Japanese syllabary!', '2022/4/13 13:37:00', 0, DEFAULT);
INSERT INTO moments VALUES (3, 2, 'Spanish is so hard, can someone help me with the grammer', '2022/4/13 13:38:40', 0 , DEFAULT);
INSERT INTO moments VALUES (4, 2, 'Tried some spanish food with my friend today so happy', '2022/4/13 13:39:20', 0, DEFAULT);
INSERT INTO comments VALUES (1, 1, 2, 'Demon Slayer is the best I have ever seen!', '2022/4/13 13:40:00', NULL, DEFAULT);
INSERT INTO comments VALUES (2, 1, 3, 'I totally AGREE!!!', '2022/4/13 13:40:00', 1, DEFAULT);
INSERT INTO like_moment VALUES (2, 1), (3, 1), (1, 4), (2, 4), (3, 4);

 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
3 rows affected.
6 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
5 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM users;

 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
5 rows affected.

[(1, 'Zhou Shen      ', 'Xxxx', 'Hi! I like cooking. I wanna to visit Japan.', 1, 4, 'zs2489@columbia.edu', 25, 1, False),
 (2, 'Tony Li        ', 'Xxxxx', 'Hi! I am a programmer, I love traveling. I wanna to visit Spain', 1, 6, 'yl4832@columbia.edu', 23, 1, False),
 (3, 'Eugene Wu      ', 'Xxxxxxxx', 'Hi! I teach database. I love coding and working out. I wanna to visit Korea.', 1, 6, 'NaN', 30, 1, False),
 (4, 'James Burton   ', 'Xxxxxxxx', 'Hi! I am a college soccer player and Im here to learn French in order to play for PSG in the future.', 3, 1, 'jb33332@columbia.edu', 22, 1, False),
 (5, 'Michelle Kim   ', 'Xxxxxxxxxx', 'NaN', 2, 2, 'mk1245112@columbia.edu', 19, 2, False)]

In [ ]:
%%sql
SELECT * FROM moments;

 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
4 rows affected.

[(2, 1, 'Today, I learned the Japanese syllabary!', datetime.datetime(2022, 4, 13, 13, 37), 0, False),
 (3, 2, 'Spanish is so hard, can someone help me with the grammer', datetime.datetime(2022, 4, 13, 13, 38, 40), 0, False),
 (1, 1, 'Just watched the Demon Slayer, yyds', datetime.datetime(2022, 4, 13, 13, 30), 2, False),
 (4, 2, 'Tried some spanish food with my friend today so happy', datetime.datetime(2022, 4, 13, 13, 39, 20), 3, False)]

In [ ]:
%%sql
SELECT * FROM comments;

 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
2 rows affected.

[(1, 1, 2, 'Demon Slayer is the best I have ever seen!', datetime.datetime(2022, 4, 13, 13, 40), None, False),
 (2, 1, 3, 'I totally AGREE!!!', datetime.datetime(2022, 4, 13, 13, 40), 1, False)]

In [ ]:
%%sql
SELECT * FROM like_moment;

 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
3 rows affected.

[(3, 1), (1, 4), (3, 4)]

In [ ]:
%%sql
DELETE FROM users WHERE user_name = 'Tony Li';

 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
(psycopg2.ProgrammingError) missing FROM-clause entry for table "delete"
LINE 3:   WHERE moment_id = DELETE.mid
                            ^
QUERY:  UPDATE moments
  SET like_count = like_count - 1
  WHERE moment_id = DELETE.mid
CONTEXT:  PL/pgSQL function f_delete_like_count() line 3 at SQL statement
SQL statement "DELETE FROM ONLY "zs2489"."like_moment" WHERE $1 OPERATOR(pg_catalog.=) "uid""

[SQL: DELETE FROM users WHERE user_name = 'Tony Li';]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [ ]:
%%sql
DELETE FROM like_moment WHERE uid = 2;

 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
2 rows affected.

[]

In [ ]:
@%%sql
INSERT INTO users VALUES (1,'Zhou Shen', 'Chinese Simplified', NULL, NULL, 'English', NULL, NULL, 'Hello, I am Zhou Shen', 'Columbia University', 'Mechanical Engineering', 'watching movies', 25, 'male');
INSERT INTO users VALUES (2,'Tony Li', 'Chinese Simplified', 'English', NULL, 'Japanese', NULL, NULL, NULL, 'Columbia University', NULL, 'watching movies', NULL, 'male');
INSERT INTO users VALUES (3,'Alexander', 'English', 'Spanish', NULL, 'French', 'Chinese Simplified', NULL, 'Hi! I work in product design field.', 'Columbia University', 'Mechanical Engineering', 'explore New York City', NULL, 'male');
INSERT INTO moments VALUES (1, 1, 'Check the English poem I made ...', '03/24/2022 19:10:45');
INSERT INTO moments VALUES (2, 1, 'Watching new Japanese animation right now ...', '03/24/2022 19:12:45');
INSERT INTO moments VALUES (3, 2, 'Japanese is so fun!', '03/24/2022 19:12:55');
INSERT INTO moments VALUES (4, 2, 'I am going to watch a Japanese movie', '03/24/2022 19:20:36');
INSERT INTO moments VALUES (5, 3, 'Chinese is so hard', '03/25/2022 12:11:40');
INSERT INTO moments VALUES (6, 3, 'I wanna try some Chinese food', '03/25/2022 17:10:45');
INSERT INTO events VALUES (1, 1, 'Columbia Mudd 233', TRUE, '2022/03/24', '2022/04/30', '15:00:00', '17:00:00', 'Th', 100);
INSERT INTO events VALUES (2, 4, '125W 109Th St.', TRUE, '2022/03/26', NULL, '09:00:00', '12:00:00', NULL, NULL);
INSERT INTO events VALUES (3, 6, 'Columbia Mudd 233', FALSE, '2022/03/25', NULL, NULL, NULL, NULL, 5);
INSERT INTO follow_records VALUES (1,2), (1,3), (2,1), (2,3), (3,1), (3,2);
INSERT INTO joinin VALUES (1,1), (1,2), (1,3), (2,1), (2,2), (2,3), (3,1), (3,2), (3,3);
INSERT INTO comments VALUES (1,1,2,'2022/03/24 23:56:00','What a wonderful poem!', NULL);
INSERT INTO comments VALUES (2,1,3,'2022/03/24 23:56:12','But I think it is not that good :(', 1);
INSERT INTO comments VALUES (3,2,1,'2022/03/24 23:56:30','I wanna join', NULL);
INSERT INTO comments VALUES (4,2,3,'2022/03/24 23:56:55','What are you watching right now', NULL);
INSERT INTO comments VALUES (5,5,2,'2022/03/24 23:58:30','Yeah it is hard', NULL);
INSERT INTO comments VALUES (6,5,3,'2022/03/24 23:58:55','It is so hard!', 5);

 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
6 rows affected.
9 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM users;

 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
2 rows affected.

[(2, 'Tony Li', 'Chinese Simplified', 'English', None, 'Japanese', None, None, None, 'Columbia University', None, 'watching movies', None, 'male'),
 (3, 'Alexander', 'English', 'Spanish', None, 'French', 'Chinese Simplified', None, 'Hi! I work in product design field.', 'Columbia University', 'Mechanical Engineering', 'explore New York City', None, 'male')]

In [ ]:
%%sql
SELECT * FROM moments;

 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
4 rows affected.

[(3, 2, 'Japanese is so fun!', datetime.datetime(2022, 3, 24, 19, 12, 55)),
 (4, 2, 'I am going to watch a Japanese movie', datetime.datetime(2022, 3, 24, 19, 20, 36)),
 (5, 3, 'Chinese is so hard', datetime.datetime(2022, 3, 25, 12, 11, 40)),
 (6, 3, 'I wanna try some Chinese food', datetime.datetime(2022, 3, 25, 17, 10, 45))]

In [ ]:
%%sql
SELECT * FROM comments;

 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
2 rows affected.

[(5, 5, 2, datetime.datetime(2022, 3, 24, 23, 58, 30), 'Yeah it is hard', None),
 (6, 5, 3, datetime.datetime(2022, 3, 24, 23, 58, 55), 'It is so hard!', 5)]

In [ ]:
%%sql
SELECT * FROM events;

 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
0 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM follow_records;

 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
2 rows affected.

[(2, 3), (3, 2)]

In [ ]:
%%sql
SELECT * FROM joinin;

 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
4 rows affected.

[(2, 2), (2, 3), (3, 2), (3, 3)]

In [ ]:
%%sql
DELETE FROM users
WHERE user_id = 1

 * postgresql://zs2489:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.

[]

In [ ]:
CREATE TABLE User ( -- consider changing name of this table to `Users` instead of `User`
    ID INT PRIMARY KEY IDENTITY(1,1), -- probably `Id` would be better name instead of `ID` because `ID` looks like SQL reserved keyword
    username VARCHAR(MAX), 
    userpass VARCHAR(MAX) -- please consider hash passwords before saving to database
)

CREATE TABLE User_Relationship ( -- here `User_Relationships` instead of `User_Relationship` as well
    user1ID INT NOT NULL,
    user2ID INT NOT NULL,
    CONSTRAINT ID PRIMARY KEY (user1ID, user2ID), -- here `Id` instead of `ID` as well
    CONSTRAINT fk_user1ID FOREIGN KEY (user1ID) REFERENCES User (ID),
    CONSTRAINT fk_user2ID FOREIGN KEY (user2ID) REFERENCES User (ID)
)

CREATE TRIGGER Delete_User_Relationships
   ON User
   INSTEAD OF DELETE
AS 
BEGIN
 SET NOCOUNT ON;
 DELETE FROM User_Relationship WHERE (user1ID IN (SELECT ID FROM DELETED)) OR (user2ID IN (SELECT ID FROM DELETED))
 DELETE FROM User WHERE ID IN (SELECT ID FROM DELETED)
END


CREATE FUNCTION f_delete_likecomment_relationships() RETURNS trigger
AS $$
BEGIN
  DELETE FROM like_moment AS lm WHERE lm.uid = NEW.user_id;
  RETURN NULL;
END;
$$ LANGUAGE plpgsql;

CREATE TRIGGER t_delete_user 
  BEFORE DELETE ON users
  FOR EACH ROW
    EXECUTE PROCEDURE f_delete_likecomment_relationships();

In [ ]:
--Reference

  user_id int,
  user_name varchar(20) NOT NULL,
  native_language_1 varchar(20) NOT NULL,
  native_language_2 varchar(20),
  native_language_3 varchar(20),
  learn_language_1 varchar(20) NOT NULL,
  learn_language_2 varchar(20),
  learn_language_3 varchar(20),
  self_introduction varchar(140),
  school_name varchar(50),
  major varchar(50),
  interests_hobbies text,
  age smallint,
  gender varchar(10),
  PRIMARY KEY(user_id),
  CONSTRAINT native_language_check1 CHECK (native_language_1 IN ('Chinese Simplified', 'Japanese', 'Korean', 'Spanish', 'French', 'Portuguese', 'German', 'Italian', 'Russian', 'Arabic', 'English')),
  CONSTRAINT native_language_check2 CHECK (native_language_2 IN ('Chinese Simplified', 'Japanese', 'Korean', 'Spanish', 'French', 'Portuguese', 'German', 'Italian', 'Russian', 'Arabic', 'English')),
  CONSTRAINT native_language_check3 CHECK (native_language_3 IN ('Chinese Simplified', 'Japanese', 'Korean', 'Spanish', 'French', 'Portuguese', 'German', 'Italian', 'Russian', 'Arabic', 'English')),
  CONSTRAINT learn_language_check1 CHECK (learn_language_1 IN ('Chinese Simplified', 'Japanese', 'Korean', 'Spanish', 'French', 'Portuguese', 'German', 'Italian', 'Russian', 'Arabic', 'English')),
  CONSTRAINT learn_language_check2 CHECK (learn_language_2 IN ('Chinese Simplified', 'Japanese', 'Korean', 'Spanish', 'French', 'Portuguese', 'German', 'Italian', 'Russian', 'Arabic', 'English')),
  CONSTRAINT learn_language_check3 CHECK (learn_language_3 IN ('Chinese Simplified', 'Japanese', 'Korean', 'Spanish', 'French', 'Portuguese', 'German', 'Italian', 'Russian', 'Arabic', 'English')),
  CONSTRAINT gender_check CHECK (gender IN ('male', 'female', 'secret'))



  CREATE TABLE events (
  event_id serial,
  mid int NOT NULL,
  loacation varchar(100),
  not_all_day bool,
  start_date date NOT NULL,
  end_date date,
  start_time time,
  end_time time,
  day_of_week varchar(2) CHECK (day_of_week IN ('Mo', 'Tu', 'We', 'Th', 'Fr', 'Sa', 'Su')),
  join_limits int CHECK (join_limits > 0),
  PRIMARY KEY(event_id),
  FOREIGN KEY(mid) REFERENCES moments(moment_id) ON DELETE CASCADE,
  CHECK (((start_time is NOT NULL AND end_time is NOT NULL) OR not_all_day = FALSE) AND ((start_time is NULL AND end_time is NULL) OR not_all_day = TRUE))
);

CREATE TABLE follow_records (
  follower_id int NOT NULL,
  followed_id int NOT NULL,
  PRIMARY KEY(follower_id, followed_id),
  FOREIGN KEY(follower_id) REFERENCES users(user_id) ON DELETE CASCADE,
  FOREIGN KEY(followed_id) REFERENCES users(user_id) ON DELETE CASCADE
);

CREATE TABLE joinin (
  uid int NOT NULL,
  eid int NOT NULL,
  PRIMARY KEY(uid, eid),
  FOREIGN KEY(uid) REFERENCES users(user_id) ON DELETE CASCADE,
  FOREIGN KEY(eid) REFERENCES events(event_id) ON DELETE CASCADE
);